# Основные методы модуля re
# re - regular expressions (регулярные выражения)

from re import *

# Метасимволы
# . - ровно один любой символ
# \d - любая цифра
# \D - любая  НЕ цифра
# \s - любой пробельный символ (пробел, tab, \n, \r)
# \S - любой НЕ пробельный символ
# \w - любая буква, цирфра, _

# Диапазоны символов
# [02468] - ровно один любой символ из указанного набора
# [a-h] - диапозон символов по алфавиту от и до
# [1-7A-K];
# ^ - исключение символов
# [^50] - символы не из заданного набора
# [а-яё] - кириллица

# Квантификаторы
# позволяют задать количество встреч символов
# {m,n} - количесвто повторений от m до n штук
# + / {1,} - хотя бы одно вхождение
# * / {0,} - любое количество вхождений
# ? / {0,1} - либо всречется один раз в тексте, либо вообще не встречается

#Скобочные группы
# (\+7|7|8) - позволяет сгруппировать символы и выбрать один из вариантов

################################################################################

#Пример 1
# +79261234567
# 79261234567
# 89261234567

data = " 111111111111111 Опа +79261234567 ШШАА 79261234567  ОААЛт 89261234567 28 лет"
pattern = r"(\+?7|8)\d{10}"

matches = [match.group() for match in finditer (pattern, data)]
print(matches)

#Пример 2
# +79261234567
# 79261234567
# 89261234567

# 9261234567
# +7 926 123 45 67
# +7-926-123-45-67

# (\+7|8|7)?((\s|-)?\d{3}){2}((\s\-)?\d{2}){2}


data = "9261234567 +7 926 123 45 67 +7-926-123-45-67 Опа +79261234567 ШШАА 79261234567  ОААЛт 89261234567 28 лет 111111111111111"
pattern = r"(\+7|8|7)?((\s|-)?\d{3}){2}((\s\-)?\d{2}){2}"

matches = [match.group() for match in finditer (pattern, data)]
print(matches)